{
    "ippf": {
      "1999": "[Asian Paints, Bajaj Holdings, Britannia Inds., Exide Inds., Cipla, P & G Health Ltd, EIH, Nestle India, GlaxoSmith C H L, Hero Motocorp, Hindalco Inds., Hind. Unilever, Gillette India, Castrol India, M & M, Bosch, MRF, Piramal Enterp., Tata Chemicals, Tata Consumer, Thomas Cook (I), Wipro, \"Dr Reddys Labs\", HCL Infosystems, Hind Lever Ch-Me, Rolta India, Tata Comm, Pentamedia Graph, Silverline Tech, NIIT, Infosys, DSQ Software, Zee Entertainmen, Pidilite Inds., Mphasis, Dabur India, BPL, Adani Enterp., Sun Pharma.Inds., PVP Ventures, I O C L, GAIL (India), Container Corpn.]",
      "2000": "[Asian Paints, Britannia Inds., Cipla, Electrost.Cast., EPL Ltd, Nestle India, GlaxoSmith C H L, Hero Motocorp, Hindalco Inds., Hind. Unilever, Gillette India, Castrol India, M & M, Bosch, Piramal Enterp., Tata Chemicals, Tata Consumer, Thomas Cook (I), Wipro, \"Dr Reddys Labs\", Rolta India, 3M India, B P C L, H P C L, C P C L, GTL, Pentamedia Graph, Silverline Tech, Morepen Labs., Mastek, NIIT, Infosys, Chambal Fert., Zee Entertainmen, Atcom Technolog, Orchid Pharma, Pidilite Inds., Mphasis, Dabur India, Vikas Wsp, BPL, Adani Enterp., Sun Pharma.Inds., PVP Ventures, Trigyn Techno., Aurobindo Pharma, Sri Adhik. Bros., I O C L, Hexaware Tech., GAIL (India), Container Corpn.]",
      "2001": "[Britannia Inds., Cipla, EPL Ltd, GlaxoSmith C H L, Hero Motocorp, Hind. Unilever, Gillette India, Piramal Enterp., Wipro, \"Dr Reddys Labs\", B P C L, H P C L, GTL, Silverline Tech, Morepen Labs., NIIT, Infosys, Zee Entertainmen, Dabur India, Sun Pharma.Inds., PVP Ventures, Aurobindo Pharma, Engineers India, GAIL (India), Container Corpn.]",
      "2002": "[Cipla, EPL Ltd, GlaxoSmith C H L, Hero Motocorp, Hindalco Inds., Gillette India, Tata Consumer, Wipro, Apollo Hospitals, \"Dr Reddys Labs\", Rolta India, B P C L, H P C L, Dredging Corpn., Silverline Tech, Mastek, NIIT, Infosys, Zee Entertainmen, Mphasis, Sun Pharma.Inds., Engineers India, GAIL (India), Container Corpn.]",
      "2003": "[Asian Paints, Cipla, Hero Motocorp, Hindalco Inds., Gillette India, Piramal Enterp., Pfizer, Reliance Industr, Tata Consumer, Wipro, \"Dr Reddys Labs\", B P C L, Bharat Electron, H P C L, Dredging Corpn., Mastek, Infosys, Lupin, Mphasis, Sun Pharma.Inds., O N G C, I O C L, Container Corpn.]",
      "2004": "[Apollo Tyres, Asian Paints, Cipla, EPL Ltd, Gammon India, Hero Motocorp, Hindalco Inds., Gillette India, J B Chem & Pharm, Piramal Enterp., Pfizer, Reliance Industr, Vedanta, Siemens, Sundaram Clayton, Sundram Fasten., Tata Consumer, Wipro, Apollo Hospitals, \"Dr Reddys Labs\", Jindal Saw, HCL Infosystems, Amtek Auto, B P C L, Bharat Electron, Natl. Aluminium, H P C L, Dredging Corpn., Infosys, Lupin, Ipca Labs., Adani Enterp., Sun Pharma.Inds., Aurobindo Pharma, HCL Technologies, O N G C, TVS Motor Co., I O C L, Engineers India, Container Corpn., Oracle Fin.Serv., FDC, Smartlink Hold., Jindal Steel, Glenmark Pharma., GE Power]",
      "2005": "[Apollo Tyres, Asian Paints, SKF India, Astrazeneca Phar, Bharat Forge, Cipla, Coromandel Inter, Eicher Motors, EPL Ltd, GE Shipping Co, Grasim Inds, Hero Motocorp, A B B, Bajaj Hindusthan, Hindalco Inds., Tata Inv.Corpn., ITC, J B Chem & Pharm, Kirl. Brothers, Lak. Mach. Works, Piramal Enterp., Reliance Industr, Vedanta, Siemens, Sundaram Clayton, Sundram Fasten., Tata Motors, Tata Steel, Unichem Labs., Wipro, Automotive Axles, Rico Auto Inds, \"Dr Reddys Labs\", Jindal Saw, HCL Infosystems, Aban Offshore, Amtek Auto, Patel Engineerin, Geodesic, Godrej Industrie, 3M India, Radico Khaitan, Mah. Seamless, Balrampur Chini, B P C L, MMTC, Bharat Electron, NLC India, Natl. Aluminium, H P C L, DCM Shriram, C P C L, NCC, Mastek, Infosys, Lupin, JSW Ispat Speci., Mercator, Ipca Labs., NxtDigital, Blue Dart Expres, Adani Enterp., Sun Pharma.Inds., Astra Microwave, Bilcare, Thermax, HCL Technologies, Cranes Software, IVRCL, O N G C, United Spirits, Engineers India, NMDC, Container Corpn., Oracle Fin.Serv., FDC, Gateway Distr., MPS, PTC India, Jindal Steel, Glenmark Pharma., Indraprastha Gas, GE Power, Balaji Telefilms]",
      "2006": "[Apollo Tyres, Ashok Leyland, Asian Paints, SKF India, Astrazeneca Phar, Bajaj Holdings, Balkrishna Inds, Berger Paints, Bharat Bijlee, Bharat Forge, Blue Star, Exide Inds., Cipla, Coromandel Inter, CG Power & Indu., EID Parry, Eicher Motors, GE T&D India, Grindwell Norton, Grasim Inds, Hero Motocorp, A B B, Bajaj Hindusthan, Hindalco Inds., Sanofi India, Tata Inv.Corpn., ITC, J B Chem & Pharm, Kirl. Brothers, Cummins India, Lak. Mach. Works, Larsen & Toubro, Manugraph India, M & M, Bosch, Piramal Enterp., Reliance Industr, Vedanta, SRF, Siemens, Sundaram Clayton, Sundram Fasten., Tata Motors, Tata Steel, Unichem Labs., Voltas, Wipro, Automotive Axles, Rico Auto Inds, Balmer Lawrie, \"Dr Reddys Labs\", Jindal Saw, Shanthi Gears, HCL Infosystems, Amtek Auto, Man Industries, Geodesic, Rolta India, Apar Inds., EMCO, Mah. Seamless, Balrampur Chini, Timken India, Bharat Electron, Natl. Aluminium, B H E L, Hindustan Zinc, DCM Shriram, C P C L, Metalyst Forg., Aarti Industries, HBL Power System, Jaybharat Text, NCC, Mastek, Infosys, Ansal Properties, Lupin, JSW Ispat Speci., Vesuvius India, Pidilite Inds., CRISIL, Havells India, Mercator, Praj Industries, Torrent Pharma., Ipca Labs., NxtDigital, Adani Enterp., Sun Pharma.Inds., Astra Microwave, Kalpataru Power, PSL, Bilcare, 63 Moons Tech., Thermax, CCL Products, Era Infra Engg., Lakshmi Energy, HCL Technologies, Cranes Software, IVRCL, O N G C, Nucleus Soft., Welspun Corp, Wockhardt, NMDC, Madhucon Project, Panacea Biotec, Container Corpn., Gokaldas Exports, Oracle Fin.Serv., Cyient, Suzlon Energy, Subex, FDC, Gateway Distr., ABG Shipyard, Castex Tech, Tulip Telecom, Birlasoft Ltd, MPS, PTC India, Jindal Steel, Glenmark Pharma., Indraprastha Gas, TajGVK Hotels, GE Power, \"Divis Lab.\", Opto Circuits, Balaji Telefilms, Prithvi Info., Godrej Consumer, Royal Orch.Hotel, AIA Engineering, Bharati Defence, Everest Kanto, Bombay Rayon, Provogue (India), Educomp Sol., B.L.Kashyap]",
      "2007": "[ACC, Apollo Tyres, Ashok Leyland, Asian Paints, SKF India, Astrazeneca Phar, Bajaj Holdings, Balkrishna Inds, Bannari Amm.Sug., Berger Paints, Bharat Bijlee, Bharat Forge, Blue Star, Carborundum Uni., Exide Inds., Cipla, Clariant Chemica, Coromandel Inter, CG Power & Indu., Eicher Motors, Elecon Engg.Co, GE T&D India, Gammon India, Kansai Nerolac, Greaves Cotton, Grindwell Norton, Grasim Inds, Hero Motocorp, A B B, Bajaj Hindusthan, Hindalco Inds., Zensar Tech., Tata Inv.Corpn., ITC, J B Chem & Pharm, Kalyani Steels, Kirl. Brothers, Cummins India, KSB, Lak. Mach. Works, Larsen & Toubro, M & M, Bosch, Piramal Enterp., Schaeffler India, Reliance Industr, Vedanta, SRF, Siemens, Sundaram Clayton, Sundram Fasten., Tata Chemicals, Tata Motors, Tata Steel, Unichem Labs., Jubilant Pharmo, Voltas, Wipro, Automotive Axles, JBF Industries, NESCO, Marathon Nextgen, Rico Auto Inds, HCL Infosystems, Kirloskar Indus., GFL, Honeywell Auto, Jyoti Structures, Amtek Auto, Man Industries, Geodesic, Rolta India, 3M India, JM Financial, EMCO, Mah. Seamless, Timken India, B P C L, MMTC, Bharat Electron, Natl. Aluminium, H P C L, B H E L, Hindustan Zinc, Tata Elxsi, DCM Shriram, C P C L, Metalyst Forg., HBL Power System, UPL, Jaybharat Text, NCC, Mastek, Himadri Special, Infosys, Ansal Properties, Lupin, JSW Ispat Speci., Ratnamani Metals, Pidilite Inds., CRISIL, Havells India, Mercator, Mphasis, Ganesh Housing, Praj Industries, Torrent Pharma., Ipca Labs., Blue Dart Expres, Adani Enterp., Sun Pharma.Inds., Astra Microwave, Kalpataru Power, PSL, Prism Johnson, Bilcare, 63 Moons Tech., Thermax, Sanghvi Movers, Era Infra Engg., Lakshmi Energy, Maruti Suzuki, HCL Technologies, Cranes Software, ICSA (India), IVRCL, Geojit Fin. Ser., O N G C, Nucleus Soft., Emami, Ahluwalia Contr., CORE Education, Welspun Corp, Wockhardt, TVS Motor Co., I O C L, NMDC, Hexaware Tech., Madhucon Project, Panacea Biotec, Sonata Software, Marico, Container Corpn., Gokaldas Exports, Oracle Fin.Serv., Cyient, Suzlon Energy, Subex, Gati, FDC, Gateway Distr., Biocon, ABG Shipyard, Sun TV Network, Bharti Airtel, Castex Tech, Tulip Telecom, Birlasoft Ltd, Tech Mahindra, Info Edg.(India), MPS, Triven.Engg.Ind., PTC India, Jindal Steel, Glenmark Pharma., Indraprastha Gas, TajGVK Hotels, Agnite Educ., \"Divis Lab.\", Opto Circuits, Balaji Telefilms, Godrej Consumer, Royal Orch.Hotel, Jagran Prakashan, AIA Engineering, Bharati Defence, T.V. Today Netw., Tanla Platforms, Jindal Stain., Parsvnath Devl., Everest Kanto, Unity Infra., Bombay Rayon, Provogue (India), Educomp Sol., B.L.Kashyap, Prime Focus, Allcargo Logist., Volt.Transform.]",
      "2008": "[ACC, Apollo Tyres, Ashok Leyland, Asian Hotels (N), Asian Paints, SKF India, Astrazeneca Phar, Balkrishna Inds, Bayer Crop Sci., Berger Paints, Bharat Bijlee, Bharat Forge, Blue Star, Britannia Inds., Graphite India, Carborundum Uni., Exide Inds., Cipla, Clariant Chemica, Coromandel Inter, CG Power & Indu., Deepak Fertiliz., EID Parry, EIH, Eicher Motors, Elecon Engg.Co, GE T&D India, Gammon India, Kansai Nerolac, GE Shipping Co, Greaves Cotton, Grindwell Norton, G N F C, Grasim Inds, Hero Motocorp, A B B, Hindalco Inds., Tata Inv.Corpn., ITC, K C P, Kirl.Pneumatic, Kalyani Steels, Kesoram Inds., Kirl. Brothers, Cummins India, KSB, Lak. Mach. Works, Larsen & Toubro, The Ramco Cement, M & M, Bosch, Oriental Hotels, Schaeffler India, Reliance Industr, Vedanta, SRF, Siemens, Sundram Fasten., Tata Chemicals, TRF, Tata Motors, Texmaco Infrast., Tata Steel, Jubilant Pharmo, Voltas, Walchan. Inds., Wipro, Automotive Axles, JBF Industries, NESCO, Sagar Cements, Titan Company, HCL Infosystems, Kirloskar Indus., India Glycols, GFL, Honeywell Auto, Sarda Energy, Esab India, Jyoti Structures, Amtek Auto, Jindal Drilling, Patel Engineerin, Man Industries, Anant Raj, Geodesic, Centrum Capital, IL&FS Inv.Manag., Rolta India, Apar Inds., 3M India, Amara Raja Batt., JM Financial, EMCO, Mah. Seamless, Timken India, B P C L, MMTC, S A I L, S T C, H P C L, B H E L, Hindustan Zinc, C P C L, Metalyst Forg., HBL Power System, UPL, Jaybharat Text, M R P L, NCC, Mastek, Himadri Special, Infosys, Ansal Properties, Lupin, JSW Ispat Speci., Ashapura Minech., Ratnamani Metals, Sanwaria Consum., Pidilite Inds., CRISIL, Havells India, Mercator, SPML Infra, Mphasis, Ganesh Housing, Praj Industries, Kirl. Ferrous, Torrent Pharma., Ipca Labs., Hindustan Copper, Blue Dart Expres, Adani Enterp., Sun Pharma.Inds., Kalpataru Power, Hind.Natl.Glass, Vipul Ltd, Greenply Industr, Prism Johnson, Bilcare, 63 Moons Tech., JSW Steel, Thermax, Sanghvi Movers, Era Infra Engg., Genus Power, Lakshmi Energy, TCS, Maruti Suzuki, Elder Pharma, HCL Technologies, Cranes Software, ICSA (India), IVRCL, Geojit Fin. Ser., O N G C, Nucleus Soft., Emami, Karuturi Global, DLF, Responsive Ind, Ahluwalia Contr., Prajay Engineers, CORE Education, Welspun Corp, Wockhardt, NTPC, I O C L, NMDC, Hexaware Tech., Madhucon Project, Panacea Biotec, Marico, KLG Systel, Container Corpn., ICRA, Oracle Fin.Serv., Cyient, Suzlon Energy, FDC, Gateway Distr., Biocon, ABG Shipyard, Sun TV Network, Bharti Airtel, Castex Tech, Century Plyboard, Tulip Telecom, Birlasoft Ltd, Tech Mahindra, Allied Digital, Info Edg.(India), Indo Tech.Trans., Triven.Engg.Ind., PTC India, Jindal Steel, Transport Corp., Mindtree, Glenmark Pharma., Indraprastha Gas, TajGVK Hotels, GE Power, Orbit Corpn., \"Divis Lab.\", Opto Circuits, Balaji Telefilms, Godrej Consumer, Jagran Prakashan, Meghmani Organ., AIA Engineering, IIFL Finance, Bharati Defence, Sh.Renuka Sugar, T.V. Today Netw., Tanla Platforms, Jai Balaji Inds., Parsvnath Devl., UltraTech Cem., Coforge, Everest Kanto, C C C L, Solar Industries, Unity Infra., Puravankara, Bombay Rayon, Kolte Patil Dev., Hubtown, Educomp Sol., Pratibha Industr, B.L.Kashyap, Adhunik Metal, Prime Focus, Allcargo Logist., Action Const.Eq., Volt.Transform., Sobha, MIC Electronics, V2 Retail, Take Solutions, Time Technoplast, Nitin Fire Prot., H D I L, Edelweiss.Fin., Brigade Enterpr., OnMobile Global, T R I L]",
      "2009": "[ACC, Apollo Tyres, Asian Hotels (N), Asian Paints, SKF India, BASF India, Berger Paints, Bharat Forge, Blue Star, Britannia Inds., Carborundum Uni., Exide Inds., Cipla, Clariant Chemica, Coromandel Inter, CG Power & Indu., EID Parry, EIH, GE T&D India, Nestle India, GE Shipping Co, G S F C, Grasim Inds, Hero Motocorp, A B B, Tata Inv.Corpn., ITC, Kesoram Inds., Kirl. Brothers, Cummins India, Lak. Mach. Works, Larsen & Toubro, The Ramco Cement, M & M, Bosch, Piramal Enterp., Reliance Industr, Vedanta, Shree Cement, Siemens, Tata Chemicals, Tata Motors, Tata Steel, Jubilant Pharmo, Voltas, Wipro, Titan Company, HCL Infosystems, Kirloskar Indus., Usha Martin, GFL, Honeywell Auto, Jindal Drilling, Patel Engineerin, Anant Raj, Geodesic, Centrum Capital, Rolta India, 3M India, JM Financial, Mah. Seamless, Sterling Intl, MMTC, S T C, B H E L, Hindustan Zinc, C P C L, UPL, Jaybharat Text, M R P L, Infosys, Lupin, JSW Ispat Speci., Sanwaria Consum., Pidilite Inds., K S Oils, CRISIL, Havells India, Mercator, Mphasis, Dabur India, Praj Industries, Torrent Pharma., Ipca Labs., Hindustan Copper, Blue Dart Expres, Sun Pharma.Inds., Kalpataru Power, Bilcare, 63 Moons Tech., JSW Steel, Thermax, Era Infra Engg., Lakshmi Energy, TCS, Maruti Suzuki, HCL Technologies, O N G C, Emami, DLF, Responsive Ind, Welspun Corp, Wockhardt, I O C L, NMDC, Punj Lloyd, GAIL (India), Marico, Oracle Fin.Serv., G M D C, Suzlon Energy, FDC, Gateway Distr., Biocon, Sun TV Network, Bharti Airtel, Century Plyboard, Tulip Telecom, Tech Mahindra, Info Edg.(India), Triven.Engg.Ind., Petronet LNG, Jindal Steel, Mindtree, Glenmark Pharma., Indraprastha Gas, GE Power, \"Divis Lab.\", Opto Circuits, Godrej Consumer, Jagran Prakashan, AIA Engineering, IIFL Finance, Sh.Renuka Sugar, Parsvnath Devl., UltraTech Cem., Everest Kanto, Coral Hub, Puravankara, Bombay Rayon, Hubtown, Dhani Services, Educomp Sol., Gokul Refoils, Allcargo Logist., Sh.Ashtavinayak, Time Technoplast, H D I L, Edelweiss.Fin., OnMobile Global, GREENETH.RES&PRO]",
      "2010": "[ACC, Apollo Tyres, Asian Paints, SKF India, Astrazeneca Phar, Bajaj Electrical, Balkrishna Inds, BASF India, Bayer Crop Sci., Berger Paints, Bharat Bijlee, Blue Star, Britannia Inds., Graphite India, Carborundum Uni., Exide Inds., Cipla, Colgate-Palmoliv, Clariant Chemica, Coromandel Inter, CG Power & Indu., Deepak Fertiliz., EID Parry, Elecon Engg.Co, Elgi Equipments, GE T&D India, Nestle India, Greaves Cotton, Grindwell Norton, Grasim Inds, GlaxoSmith C H L, Hero Motocorp, A B B, Hind.Dorr-Oliver, HEG, Zensar Tech., India Cements, Gillette India, Tata Steel Long, ITC, J B Chem & Pharm, Whirlpool India, Kesoram Inds., Kirl. Brothers, Larsen & Toubro, The Ramco Cement, M & M, Bosch, Peninsula Land, MRF, Piramal Enterp., Prakash Industri, Schaeffler India, Reliance Industr, Vedanta, Shree Cement, SRF, Siemens, Supreme Inds., Tata Chemicals, TRF, Texmaco Infrast., Tinplate Co., Tata Steel, Voltas, Walchan. Inds., Wipro, Godfrey Phillips, JBF Industries, NESCO, V I P Inds., McNally Bharat, \"Dr Reddys Labs\", Banco Products, Titan Company, Jain Irrigation, GFL, Honeywell Auto, Sarda Energy, Esab India, Jyoti Structures, Jindal Drilling, Patel Engineerin, Anant Raj, Geodesic, Centrum Capital, IL&FS Inv.Manag., Rolta India, Apar Inds., 3M India, Johnson Con. Hit, Amara Raja Batt., EMCO, ISGEC Heavy, Mah. Seamless, Sterling Intl, MMTC, B H E L, Hindustan Zinc, Tata Elxsi, HBL Power System, UPL, Himadri Special, Infosys, Ansal Properties, Simplex Infra, Lupin, Sanwaria Consum., Pidilite Inds., K S Oils, CRISIL, Havells India, SPML Infra, Mphasis, Dabur India, Ganesh Housing, Praj Industries, Torrent Pharma., Ipca Labs., Hindustan Copper, Savita Oil Tech, TTK Prestige, Sun Pharma.Inds., Kalpataru Power, Ushdev Intl., Prism Johnson, Bilcare, 63 Moons Tech., SEAMEC Ltd, JSW Steel, Thermax, Sanghvi Movers, Selan Expl. Tech, Era Infra Engg., Shilpa Medicare, Lakshmi Energy, Kwality, Oscar Investment, TCS, Oil India, Cox & Kings, Maruti Suzuki, HCL Technologies, ICSA (India), Geojit Fin. Ser., Zydus Wellness, Emami, Karuturi Global, DLF, Responsive Ind, Ahluwalia Contr., CORE Education, Welspun Corp, Engineers India, NMDC, Panacea Biotec, Sonata Software, Page Industries, Marico, Capri Global, ICRA, Oracle Fin.Serv., Cyient, G M D C, Suzlon Energy, Jyothy Labs, Biocon, ABG Shipyard, Sun TV Network, Bharti Airtel, Godrej Propert., Century Plyboard, Tulip Telecom, Birlasoft Ltd, J K Cements, Tech Mahindra, Mahindra Holiday, Allied Digital, Info Edg.(India), Titagarh Wagons, Triven.Engg.Ind., Petronet LNG, Jindal Steel, Transport Corp., Mindtree, Glenmark Pharma., Indraprastha Gas, GE Power, Orbit Corpn., \"Divis Lab.\", Opto Circuits, Sterlite Tech., Godrej Consumer, Jagran Prakashan, AIA Engineering, IIFL Finance, Sh.Renuka Sugar, Nectar Lifesci., T.V. Today Netw., Parsvnath Devl., UltraTech Cem., Everest Kanto, C C C L, Solar Industries, Unity Infra., Puravankara, Glodyne Techno., Hubtown, Dhani Services, Godawari Power, Educomp Sol., Pratibha Industr, Gokul Refoils, B.L.Kashyap, JSW Energy, Allcargo Logist., Volt.Transform., Sh.Ashtavinayak, Everonn Educat., Sobha, Ess Dee Alumin., Zee Media, Omaxe, Time Technoplast, H D I L, Man Infra, Kiri Industries, Edelweiss.Fin., eClerx Services, OnMobile Global, Vascon Engineers, ARSS Infra, Infinite Comp, Aqua Logistics]",
      "2011": "[ACC, Aegis Logistics, Apollo Tyres, Ashok Leyland, Asian Paints, SKF India, Astrazeneca Phar, Bajaj Electrical, Balkrishna Inds, BASF India, Bayer Crop Sci., Berger Paints, Bharat Bijlee, Blue Star, Britannia Inds., Carborundum Uni., Exide Inds., Cipla, Colgate-Palmoliv, Coromandel Inter, CG Power & Indu., Deepak Fertiliz., EID Parry, Elecon Engg.Co, Elgi Equipments, GE T&D India, Nestle India, Kansai Nerolac, Grindwell Norton, Ambuja Cements, Grasim Inds, GlaxoSmith C H L, Hero Motocorp, A B B, Hind.Dorr-Oliver, HEG, Zensar Tech., India Cements, Gillette India, Tata Steel Long, ITC, Whirlpool India, Kesoram Inds., Cummins India, Larsen & Toubro, The Ramco Cement, M & M, Bosch, MRF, Heidelberg Cem., Orient Paper, Prakash Industri, Schaeffler India, Vedanta, Shree Cement, SRF, JK Lakshmi Cem., Supreme Inds., Tata Chemicals, TRF, Thomas Cook (I), Tata Steel, TIL, Voltas, Walchan. Inds., Wipro, Automotive Axles, Godfrey Phillips, JBF Industries, NESCO, V I P Inds., McNally Bharat, \"Dr Reddys Labs\", Unitech, Titan Company, Polyplex Corpn, Pennar Industrie, Jain Irrigation, GFL, Kajaria Ceramics, Honeywell Auto, Esab India, Jyoti Structures, Elantas Beck, \"Venkys (India)\", Jindal Drilling, Patel Engineerin, Swaraj Engines, Uflex, Geodesic, IL&FS Inv.Manag., Rolta India, Apar Inds., 3M India, Johnson Con. Hit, Amara Raja Batt., Sandur Manganese, ISGEC Heavy, Sterling Intl, B H E L, Hindustan Zinc, Genesys Intl., UPL, P I Industries, Himadri Special, Infosys, Tide Water Oil, Simplex Infra, Lupin, Ratnamani Metals, Vesuvius India, Pidilite Inds., Diamond Power, K S Oils, CRISIL, Havells India, SPML Infra, Mphasis, Dabur India, Praj Industries, Symphony, Vakrangee, Torrent Pharma., Ipca Labs., Savita Oil Tech, Jindal Poly Film, Blue Dart Expres, TTK Prestige, Sun Pharma.Inds., Kalpataru Power, Natco Pharma, Ushdev Intl., Prism Johnson, Bilcare, 63 Moons Tech., JSW Steel, Thermax, Selan Expl. Tech, Shilpa Medicare, TCS, Oil India, Cox & Kings, Maruti Suzuki, HCL Technologies, ICSA (India), KRBL, Geojit Fin. Ser., Zydus Wellness, Emami, Karuturi Global, DLF, Responsive Ind, Ahluwalia Contr., CORE Education, Welspun Corp, Engineers India, NMDC, GAIL (India), Page Industries, Marico, ICRA, Oracle Fin.Serv., Cyient, MOIL, G M D C, FDC, Biocon, ABG Shipyard, BGR Energy Sys., Sun TV Network, Bharti Airtel, Godrej Propert., Century Plyboard, Tulip Telecom, Birlasoft Ltd, J K Cements, Tech Mahindra, Mahindra Holiday, Persistent Sys, Info Edg.(India), V-Guard Industri, Titagarh Wagons, Petronet LNG, Jindal Steel, Transport Corp., Mindtree, Glenmark Pharma., Indraprastha Gas, Orbit Corpn., \"Divis Lab.\", Opto Circuits, Sterlite Tech., Godrej Consumer, Jagran Prakashan, AIA Engineering, IIFL Finance, Guj.St.Petronet, Veritas (India), UltraTech Cem., Coforge, Mcleod Russel, Everest Kanto, C C C L, Solar Industries, Puravankara, Glodyne Techno., Hubtown, Godawari Power, Educomp Sol., Pratibha Industr, Gokul Refoils, Kewal Kir.Cloth., K E C Intl., JSW Energy, Allcargo Logist., Volt.Transform., Everonn Educat., Ess Dee Alumin., Time Technoplast, H D I L, Man Infra, Motil.Oswal.Fin., Edelweiss.Fin., Tecpro Systems, eClerx Services, Brigade Enterpr., OnMobile Global, Vascon Engineers, D B Corp, Ramky Infra, ARSS Infra, A2Z Infra Engg., Infinite Comp, Shree Gan.Jew., Aqua Logistics, Gravita India, Va Tech Wabag, Eros Intl.Media, Oberoi Realty, Career Point]",
      "2012": "[Aegis Logistics, Apollo Tyres, Asian Paints, Bajaj Electrical, Balkrishna Inds, BASF India, Bayer Crop Sci., Berger Paints, Britannia Inds., Carborundum Uni., Exide Inds., Cipla, Colgate-Palmoliv, Coromandel Inter, Deepak Fertiliz., EID Parry, Eicher Motors, Elecon Engg.Co, Elgi Equipments, GE T&D India, Nestle India, Kansai Nerolac, Grindwell Norton, GlaxoSmith C H L, Hero Motocorp, Zensar Tech., ITC, Whirlpool India, Larsen & Toubro, The Ramco Cement, M & M, Bosch, MRF, Heidelberg Cem., Orient Paper, Prakash Industri, Schaeffler India, Hawkins Cookers, Rallis India, P & G Hygiene, Vedanta, Shree Cement, SRF, JK Lakshmi Cem., Supreme Inds., Voltas, VST Industries, Wipro, Godfrey Phillips, JBF Industries, Titan Company, Polyplex Corpn, Jain Irrigation, GFL, Kajaria Ceramics, Honeywell Auto, Jindal Drilling, Uflex, IL&FS Inv.Manag., Apar Inds., 3M India, Amara Raja Batt., Swan Energy, ISGEC Heavy, Timken India, B H E L, Metalyst Forg., UPL, P I Industries, Infosys, Tide Water Oil, Lupin, S Kumars Nation, Pidilite Inds., CRISIL, Havells India, Mphasis, Tilaknagar Inds., Dabur India, Vikas Wsp, Symphony, Vakrangee, Torrent Pharma., Ipca Labs., Savita Oil Tech, Jindal Poly Film, Blue Dart Expres, TTK Prestige, Sun Pharma.Inds., Kalpataru Power, Natco Pharma, Ushdev Intl., Prism Johnson, Thermax, Shilpa Medicare, Oscar Investment, TCS, Cox & Kings, Maruti Suzuki, HCL Technologies, Zydus Wellness, Emami, DLF, Responsive Ind, Paisalo Digital, CORE Education, Welspun Corp, Coal India, Engineers India, NMDC, GAIL (India), Page Industries, Marico, ICRA, Ajanta Pharma, Cyient, MOIL, G M D C, Rupa & Co, Jubilant Food., Jyothy Labs, Biocon, ABG Shipyard, BGR Energy Sys., Sun TV Network, Bharti Airtel, Century Plyboard, Lovable Lingerie, Tulip Telecom, Birlasoft Ltd, Hindustan Media, Mahindra Holiday, Persistent Sys, Torrent Power, Info Edg.(India), V-Guard Industri, Titagarh Wagons, Petronet LNG, Jindal Steel, Mindtree, Glenmark Pharma., Indraprastha Gas, \"Divis Lab.\", Opto Circuits, Sterlite Tech., Godrej Consumer, Jagran Prakashan, AIA Engineering, IIFL Finance, Guj.St.Petronet, Veritas (India), UltraTech Cem., Mcleod Russel, Solar Industries, Multi Comm. Exc., Glodyne Techno., Hubtown, Vivimed Labs., Educomp Sol., Gokul Refoils, Kewal Kir.Cloth., K E C Intl., Plethico Pharma., Allcargo Logist., Everonn Educat., Texmaco Rail, Ess Dee Alumin., Time Technoplast, Insecticid.India, Nitin Fire Prot., Man Infra, Kaveri Seed Co., Tecpro Systems, eClerx Services, D B Corp, Ramky Infra, A2Z Infra Engg., Dr.Datsons Labs, Shree Gan.Jew., TD Power Systems, Gravita India, Va Tech Wabag, Eros Intl.Media, Oberoi Realty, Bajaj Consumer]",
      "2013": "[Apollo Tyres, Asian Paints, Bajaj Electrical, Balkrishna Inds, Bannari Amm.Sug., BASF India, Bata India, Bayer Crop Sci., Berger Paints, Britannia Inds., Carborundum Uni., Cipla, Colgate-Palmoliv, Coromandel Inter, Deepak Fertiliz., EID Parry, P & G Health Ltd, Eicher Motors, Elgi Equipments, Nestle India, Kansai Nerolac, Grindwell Norton, GlaxoSmith C H L, Hero Motocorp, Zensar Tech., Gillette India, ITC, Larsen & Toubro, M & M, Peninsula Land, MRF, Schaeffler India, Hawkins Cookers, Rallis India, P & G Hygiene, Shree Cement, SRF, Supreme Inds., Godfrey Phillips, JBF Industries, \"Dr Reddys Labs\", Titan Company, Polyplex Corpn, Jain Irrigation, GFL, Kajaria Ceramics, Uflex, Dhanuka Agritech, 3M India, Amara Raja Batt., Swan Energy, Vinati Organics, B H E L, Aarti Industries, UPL, M R P L, P I Industries, Infosys, Tide Water Oil, Lupin, Zee Entertainmen, Sanwaria Consum., Pidilite Inds., CRISIL, Tilaknagar Inds., Dabur India, Symphony, Vakrangee, Torrent Pharma., Ipca Labs., Savita Oil Tech, Blue Dart Expres, Som Distilleries, TTK Prestige, Sun Pharma.Inds., Kalpataru Power, Ushdev Intl., Prism Johnson, Shilpa Medicare, Relaxo Footwear, TCS, Cox & Kings, Maruti Suzuki, HCL Technologies, KRBL, Zydus Wellness, Emami, Responsive Ind, Paisalo Digital, CORE Education, Engineers India, GAIL (India), Page Industries, Marico, ICRA, CARE Ratings, Ajanta Pharma, Cyient, Rupa & Co, Jubilant Food., Biocon, BGR Energy Sys., Accelya Solution, Sun TV Network, Bharti Airtel, Birlasoft Ltd, Hindustan Media, Persistent Sys, Torrent Power, Info Edg.(India), V-Guard Industri, T B Z, Petronet LNG, Jindal Steel, Mindtree, Indraprastha Gas, Brightcom Group, \"Divis Lab.\", Opto Circuits, Godrej Consumer, Jagran Prakashan, Cera Sanitary., AIA Engineering, Guj.St.Petronet, Tilak Ventures, UltraTech Cem., Coforge, Mcleod Russel, Solar Industries, Multi Comm. Exc., K E C Intl., Allcargo Logist., Texmaco Rail, Astral, Time Technoplast, Insecticid.India, Nitin Fire Prot., Kaveri Seed Co., Bajaj Auto, eClerx Services, J Kumar Infra, GB Global, BS, Speciality Rest., PC Jeweller, Shree Gan.Jew., Goenka Diamond, Va Tech Wabag, Eros Intl.Media, Oberoi Realty, Bajaj Consumer]",
      "2014": "[Apollo Tyres, Asian Paints, Atul, Bajaj Electrical, Balkrishna Inds, BASF India, Bata India, Bayer Crop Sci., Berger Paints, Bombay Burmah, Britannia Inds., CEAT, Exide Inds., Cipla, Colgate-Palmoliv, Deepak Fertiliz., P & G Health Ltd, Eicher Motors, Elgi Equipments, Nestle India, Kansai Nerolac, GlaxoSmith C H L, Hero Motocorp, Zensar Tech., Gillette India, ITC, M & M, MRF, Rallis India, P & G Hygiene, Vedanta, Shree Cement, Somany Ceramics, Supreme Inds., Thomas Cook (I), VST Industries, Automotive Axles, Godfrey Phillips, Disa India, Banco Products, Titan Company, Honda India, GFL, Kajaria Ceramics, Swaraj Engines, Uflex, Dhanuka Agritech, 3M India, Amara Raja Batt., Vinati Organics, Hindustan Zinc, UPL, VST Till. Tract., P I Industries, Infosys, Lupin, Zee Entertainmen, Pidilite Inds., CRISIL, Tilaknagar Inds., Dabur India, Symphony, Vakrangee, Supreme Petroch., Torrent Pharma., Ipca Labs., Butterfly Gan Ap, Mayur Uniquoters, Jindal Poly Film, Som Distilleries, TTK Prestige, Sun Pharma.Inds., Aurobindo Pharma, Ushdev Intl., Suven Life Scie., La Opala RG, NRB Bearings, Shilpa Medicare, Relaxo Footwear, TCS, Maruti Suzuki, HCL Technologies, KRBL, Suprajit Engg., Zydus Wellness, Emami, Paisalo Digital, GAIL (India), Page Industries, ICRA, CARE Ratings, Ajanta Pharma, Cyient, Poly Medicure, Rupa & Co, Jubilant Food., Accelya Solution, Sun TV Network, Lovable Lingerie, Birlasoft Ltd, Tech Mahindra, Hindustan Media, Persistent Sys, Info Edg.(India), V-Guard Industri, T B Z, Petronet LNG, Mindtree, Glenmark Pharma., Indraprastha Gas, Brightcom Group, \"Divis Lab.\", Godrej Consumer, Jagran Prakashan, Cera Sanitary., AIA Engineering, Guj.St.Petronet, Tilak Ventures, UltraTech Cem., Coforge, Mcleod Russel, Solar Industries, Kewal Kir.Cloth., K E C Intl., Texmaco Rail, Astral, Time Technoplast, Nitin Fire Prot., Kaveri Seed Co., Bajaj Auto, eClerx Services, GB Global, Infinite Comp, BS, Speciality Rest., PC Jeweller, V-Mart Retail, Bajaj Consumer, Just Dial, Eco Friendly, Esteem Bio Org., HPC Biosciences]",
      "2015": "[Asian Paints, Atul, Balkrishna Inds, Bata India, Bayer Crop Sci., Berger Paints, Bharat Forge, Bliss GVS Pharma, Abbott India, Britannia Inds., CEAT, Exide Inds., Cipla, Colgate-Palmoliv, Eicher Motors, Gabriel India, Kansai Nerolac, Setco Automotive, GlaxoSmith C H L, Sanofi India, Zensar Tech., Akzo Nobel, Gillette India, ITC, Lak. Mach. Works, Bosch, Pfizer, Schaeffler India, Rallis India, P & G Hygiene, Vedanta, Siyaram Silk, Somany Ceramics, Supreme Inds., Tata Motors, Thomas Cook (I), WPIL, Alkyl Amines, Empire Inds., Sudarshan Chem., \"Dr Reddys Labs\", Disa India, INEOS Styrolut., Banco Products, Titan Company, Honda India, Huhtamaki India, GFL, Kajaria Ceramics, Honeywell Auto, Uflex, L G Balakrishnan, Apar Inds., Amara Raja Batt., Timken India, Vinati Organics, Tata Elxsi, Aarti Industries, Arcotech Ltd, UPL, P I Industries, Apcotex Industri, Infosys, Aarti Drugs, Lupin, Zee Entertainmen, Pidilite Inds., CRISIL, Foseco India, Dabur India, Igarashi Motors, Symphony, Vakrangee, Torrent Pharma., Avanti Feeds, Mayur Uniquoters, Wim Plast, Jindal Poly Film, Blue Dart Expres, Mirza Internatio, TTK Prestige, Sun Pharma.Inds., Heritage Foods, Caplin Point Lab, Astra Microwave, Centum Electron, Kitex Garments, Aurobindo Pharma, Ushdev Intl., CCL Products, Suven Life Scie., La Opala RG, Shilpa Medicare, Relaxo Footwear, TCS, HCL Technologies, KRBL, Suprajit Engg., Emami, The Byke Hospi., Paisalo Digital, TVS Motor Co., Hexaware Tech., APL Apollo Tubes, GAIL (India), Page Industries, Indoco Remedies, Marico, Granules India, Rajesh Exports, Ajanta Pharma, Cyient, Poly Medicure, Jubilant Food., Atul Auto, Birlasoft Ltd, Tech Mahindra, Hindustan Media, Persistent Sys, Info Edg.(India), V-Guard Industri, T B Z, Petronet LNG, Mindtree, Glenmark Pharma., Indraprastha Gas, Brightcom Group, \"Divis Lab.\", AXISCADES Tech., Godrej Consumer, Cera Sanitary., AIA Engineering, JBM Auto, SecureKloud Tech, UltraTech Cem., Coforge, Fiem Industries, Solar Industries, Skipper, Kewal Kir.Cloth., K E C Intl., Texmaco Rail, MBL Infrast, Astral, Take Solutions, Insecticid.India, Nitin Fire Prot., Camlin Fine, Kaveri Seed Co., eClerx Services, GB Global, Infinite Comp, BS, D-Link India, Expleo Solutions, PC Jeweller, V-Mart Retail, Sharda Cropchem, Talwal.Better, Eros Intl.Media, Bajaj Consumer, Kridhan Infra, Aditya Bir. Fas., Just Dial, Esteem Bio Org., HPC Biosciences, Wonderla Holiday, Monte Carlo Fas.]",
      "2016": "[Asian Paints, Bliss GVS Pharma, Abbott India, Cipla, Sanofi India, Zensar Tech., Akzo Nobel, P & G Hygiene, Siyaram Silk, Somany Ceramics, Tata Motors, Alkyl Amines, NESCO, \"Dr Reddys Labs\", Huhtamaki India, GFL, Kajaria Ceramics, Amara Raja Batt., High Ground, Timken India, Tata Elxsi, Aarti Industries, Arcotech Ltd, UPL, P I Industries, Ashiana Housing, Infosys, Aarti Drugs, Lupin, Ashapura Minech., Ratnamani Metals, Pidilite Inds., CRISIL, Marksans Pharma, Igarashi Motors, Vakrangee, Torrent Pharma., Arrow Greentech, Avanti Feeds, Wim Plast, Blue Dart Expres, TTK Prestige, Sun Pharma.Inds., Heritage Foods, Shreyas Shipping, Caplin Point Lab, Astra Microwave, Kitex Garments, DFM Foods, Aurobindo Pharma, KEI Industries, Natco Pharma, Ushdev Intl., CCL Products, Suven Life Scie., La Opala RG, Kellton Tech, Shilpa Medicare, Relaxo Footwear, TCS, KRBL, Suprajit Engg., The Byke Hospi., Hexaware Tech., APL Apollo Tubes, Page Industries, Indoco Remedies, Granules India, Rajesh Exports, Ajanta Pharma, Cyient, Poly Medicure, Jubilant Food., Stampede Cap., Atul Auto, Birlasoft Ltd, Tech Mahindra, Persistent Sys, Info Edg.(India), Alkem Lab, V-Guard Industri, R Systems Intl., Petronet LNG, Mindtree, Glenmark Pharma., Indraprastha Gas, Brightcom Group, \"Divis Lab.\", AXISCADES Tech., Cigniti Tech., Godrej Consumer, Cera Sanitary., Triveni Turbine, S H Kelkar & Co., JBM Auto, SecureKloud Tech, Coforge, Fiem Industries, Solar Industries, Syngene Intl., Skipper, Kolte Patil Dev., MBL Infrast, Astral, Take Solutions, Insecticid.India, Camlin Fine, Kaveri Seed Co., eClerx Services, Infinite Comp, BS, Expleo Solutions, PC Jeweller, V-Mart Retail, Power Mech Proj., Sharda Cropchem, Va Tech Wabag, Talwal.Better, Eros Intl.Media, Bajaj Consumer, Alembic Pharma, Kridhan Infra, Aditya Bir. Fas., Dr Lal Pathlabs, MT Educare, Just Dial, Shemaroo Entert., HPC Biosciences, Wonderla Holiday, Kushal, Inox Wind, Gulf Oil Lubric., Monte Carlo Fas., Quick Heal Tech]",
      "2017": "[Bliss GVS Pharma, Cipla, Ambuja Cements, Indian Hume Pipe, Stovec Inds., NESCO, Vindhya Telelink, Huhtamaki India, HFCL, Centrum Capital, TCPL Packaging, Tasty Bite Eat., Johnson Con. Hit, Amara Raja Batt., Gufic BioScience, Tata Elxsi, Arcotech Ltd, UPL, Kovai Medical, P I Industries, Bharat Rasayan, Infosys, Lupin, Zee Entertainmen, Marksans Pharma, Symphony, Vakrangee, Alphageo (India), Torrent Pharma., Avanti Feeds, Capital Trust, AksharChem (I), Hester Bios, Sun Pharma.Inds., Shreyas Shipping, Caplin Point Lab, Centum Electron, DFM Foods, Aurobindo Pharma, Natco Pharma, Privi Speci., Suven Life Scie., Chamanlal Setia, La Opala RG, Kellton Tech, Shilpa Medicare, Bhageria Indust., TCS, HCL Technologies, Suprajit Engg., Vikas Ecotech, The Byke Hospi., NBI Indl. Fin., Hexaware Tech., APL Apollo Tubes, Page Industries, Granules India, Rajesh Exports, NBCC, Ajanta Pharma, Cyient, Poly Medicure, Jubilant Food., Birlasoft Ltd, Tech Mahindra, Orient Cement, L & T Infotech, Persistent Sys, Alkem Lab, V-Guard Industri, Mindtree, Glenmark Pharma., \"Divis Lab.\", AXISCADES Tech., Cigniti Tech., BLS Internat., Cera Sanitary., Nitin Spinners, T.V. Today Netw., Guj.St.Petronet, Deep Energy, SecureKloud Tech, Syngene Intl., Skipper, Kolte Patil Dev., Astral, K P R Mill Ltd, eClerx Services, Infinite Comp, Expleo Solutions, PC Jeweller, V-Mart Retail, Sh.Pushkar Chem., Sharda Cropchem, Va Tech Wabag, Indian Terrain, Alembic Pharma, Ujaas Energy, Avenue Super., Dr Lal Pathlabs, Just Dial, Shemaroo Entert., Thyrocare Tech., Ashapura Inti., Wonderla Holiday, Kushal, Inox Wind, Quess Corp, Gulf Oil Lubric., Laurus Labs, Manpasand Bever.]",
      "2018": "[Bliss GVS Pharma, Indian Hume Pipe, Schaeffler India, Stovec Inds., Sundaram Clayton, Automotive Axles, NESCO, Vindhya Telelink, Huhtamaki India, HFCL, Bhansali Engg., Centrum Capital, Tasty Bite Eat., Johnson Con. Hit, Amara Raja Batt., Sandur Manganese, Gufic BioScience, Tata Elxsi, Bharat Rasayan, Waterbase, Bodal Chemicals, Multibase India, Marksans Pharma, Control Print, Igarashi Motors, Symphony, Vakrangee, Avanti Feeds, Hester Bios, Sun Pharma.Inds., Caplin Point Lab, Centum Electron, Aurobindo Pharma, KEI Industries, Natco Pharma, Panama Petrochem, Privi Speci., Stylam Industrie, Suven Life Scie., Chamanlal Setia, Kellton Tech, Shilpa Medicare, Alankit, Suprajit Engg., Shakti Pumps, Shaily Engineer., Jindal Worldwide, Apollo Pipes, Arfin India, TVS Motor Co., Hexaware Tech., APL Apollo Tubes, Page Industries, Nippon Life Ind., Granules India, Rajesh Exports, NBCC, Ajanta Pharma, Cyient, Newgen Software, Jubilant Food., Strides Pharma, Tech Mahindra, Bharat Dynamics, Persistent Sys, Alkem Lab, S Chand & Compan, C D S L, Mindtree, Cigniti Tech., BLS Internat., Cera Sanitary., Nitin Spinners, T.V. Today Netw., Guj.St.Petronet, SecureKloud Tech, Team Lease Serv., Fiem Industries, Syngene Intl., Skipper, Astec Lifescienc, Astral, eClerx Services, J Kumar Infra, PC Jeweller, V-Mart Retail, Sh.Pushkar Chem., Sharda Cropchem, Gravita India, Dixon Technolog., Va Tech Wabag, Mahindra Logis., SIS, Indian Terrain, Alembic Pharma, Arvind SmartSp., Avenue Super., Paul Merchants, Dr Lal Pathlabs, Just Dial, Shemaroo Entert., Thyrocare Tech., Ashapura Inti., Kushal, Quess Corp, L&T Technology, Gulf Oil Lubric., Laurus Labs, ERIS Lifescience, PSP Projects, Apex Frozen Food, \"Capacite Infra.\", Apollo Micro Sys, H.G. Infra Engg.]",
      "2019": "[Bliss GVS Pharma, Graphite India, Fermenta Biotec., HEG, Hil Ltd, Whirlpool India, NCL Industries, Schaeffler India, Shree Cement, Sundaram Clayton, Transpek Inds., Ultramarine Pig., WPIL, Automotive Axles, NESCO, Vindhya Telelink, Huhtamaki India, Jamna Auto Inds., HFCL, Bhansali Engg., Shivalik Bimetal, Tasty Bite Eat., India Nipp.Elec., IOL Chemicals, Johnson Con. Hit, Sandur Manganese, ISGEC Heavy, Timken India, Ganesha Ecosphe., Gufic BioScience, Tata Elxsi, UPL, Apcotex Industri, Bharat Rasayan, Ratnamani Metals, Mphasis, M M Forgings, Avanti Feeds, Hester Bios, Som Distilleries, Caplin Point Lab, Centum Electron, Aurobindo Pharma, KEI Industries, Natco Pharma, Privi Speci., Stylam Industrie, Alicon Cast., Suprajit Engg., Zydus Wellness, Shaily Engineer., Paushak, TVS Motor Co., Hexaware Tech., APL Apollo Tubes, ICICI Securities, Page Industries, Nippon Life Ind., Granules India, Rajesh Exports, NBCC, Cyient, Newgen Software, Jubilant Food., Maithan Alloys, Persistent Sys, Alkem Lab, C D S L, Mindtree, HDFC AMC, Cigniti Tech., BLS Internat., Cera Sanitary., ICICI Lombard, Balmer Law. Inv., Guj.St.Petronet, Navin Fluo.Intl., Team Lease Serv., Solar Industries, Syngene Intl., Sakuma Exports, Astec Lifescienc, Astral, Take Solutions, Kiri Industries, GNA Axles, V-Mart Retail, Sh.Pushkar Chem., Sharda Cropchem, Dixon Technolog., Mahindra Logis., SIS, Future Supply, Alembic Pharma, Avenue Super., Dr Lal Pathlabs, Shemaroo Entert., Thyrocare Tech., Kushal, Greenlam Industr, Quess Corp, L&T Technology, Gulf Oil Lubric., Valiant Organics, TCNS Clothing Co, PSP Projects, \"Capacite Infra.\", H.G. Infra Engg.]",
      "2020": "[Deepak Nitrite, Fermenta Biotec., Schaeffler India, Automotive Axles, Alkyl Amines, NESCO, Safari Inds., Vindhya Telelink, Huhtamaki India, Tasty Bite Eat., IOL Chemicals, UPL, Bharat Rasayan, Symphony, HLE Glascoat, Avanti Feeds, Hester Bios, Caplin Point Lab, KEI Industries, Natco Pharma, Privi Speci., Cochin Shipyard, Suprajit Engg., Zydus Wellness, Satia Industries, Hexaware Tech., APL Apollo Tubes, Sonata Software, Newgen Software, Godrej Agrovet, L & T Infotech, Alkem Lab, C D S L, Mindtree, HDFC AMC, Cigniti Tech., ICICI Lombard, Balmer Law. Inv., I R C T C, Sumitomo Chemi., Guj.St.Petronet, Rites, Team Lease Serv., Syngene Intl., KNR Construct., Interglobe Aviat, V-Mart Retail, Dixon Technolog., Alembic Pharma, Avenue Super., Tube Investments, Dr Lal Pathlabs, Thyrocare Tech., L&T Technology, Crompton Gr. Con, TCI Express, Valiant Organics, TCNS Clothing Co, PSP Projects, H.G. Infra Engg., Sirca Paints, Affle India, Neogen Chemicals]",
      "2021": "[Oriental Aromat., Deepak Nitrite, Fermenta Biotec., Ambuja Cements, Hil Ltd, NCL Industries, Schaeffler India, Shree Cement, Supreme Inds., Alkyl Amines, GMM Pfaudler, Bhansali Engg., United Drilling, IOL Chemicals, Sandur Manganese, Gufic BioScience, UPL, Black Rose Indus, P I Industries, Mastek, Bharat Rasayan, Axtel Industries, Symphony, HLE Glascoat, Avanti Feeds, Hester Bios, Caplin Point Lab, NGL Fine Chem, Kellton Tech, Balaji Amines, HCL Technologies, Balu Forge, Shakti Pumps, Apollo Pipes, Engineers India, NMDC, APL Apollo Tubes, ICICI Securities, Sonata Software, Granules India, Gland Pharma, Dwarikesh Sugar, L & T Infotech, Triven.Engg.Ind., C D S L, Sterlite Tech., Balaxi Pharma, ICICI Lombard, Balmer Law. Inv., Lux Industries, Sumitomo Chemi., Guj.St.Petronet, Astec Lifescienc, Motil.Oswal.Fin., KNR Construct., Heranba Inds, Prince Pipes, Gravita India, Dixon Technolog., Techno Elec.Engg, SIS, Indus Towers, Avenue Super., Tube Investments, JTL Infra, Thyrocare Tech., Indigo Paints, Apollo Tricoat, Antony Waste han, Suumaya Indust., Laurus Labs, Metropolis Healt, Crompton Gr. Con, ERIS Lifescience, Bajaj Healthcare, TCI Express, Valiant Organics, PSP Projects, GTPL Hathway, Share India Sec., H.G. Infra Engg., Route Mobile, Sirca Paints, Rossari Biotech, Affle India, Neogen Chemicals, Chemcon Special., Likhitha Infra.]",
      "2022": "[Balkrishna Inds, Graphite India, Deepak Nitrite, Fermenta Biotec., Excel Industries, Saregama India, Guj. Themis Bio., HEG, Hil Ltd, NCL Industries, NOCIL, Schaeffler India, SRF, Tanfac Inds., Tinplate Co., Alkyl Amines, T N Petro Prod., GMM Pfaudler, Titan Company, Polyplex Corpn, Hindustan Foods, Kirloskar Indus., Sarda Energy, HFCL, RACL Geartech, Acrysil, Bhansali Engg., Rama Phosphates, United Drilling, Khaitan Chemical, Manali Petrochem, Sh. Jagdamba Pol, IOL Chemicals, Sandur Manganese, Timken India, Andhra Petrochem, Vinati Organics, Gufic BioScience, Aarti Industries, Prec. Wires (I), ADF Foods, Black Rose Indus, P I Industries, Apcotex Industri, Mastek, Bharat Rasayan, BCL Industries, Aarti Drugs, Chambal Fert., Ratnamani Metals, Filatex India, Havells India, Steelcast, Kirl. Ferrous, HLE Glascoat, Vishnu Chemicals, Mangalam Organic, KMC Speciality, Monarch Networth, Indo Amines, Jyoti Resins, Rajratan Global, Caplin Point Lab, Goldiam Intl., NGL Fine Chem, KEI Industries, Panama Petrochem, JSW Steel, Stylam Industrie, Balaji Amines, Shaily Engineer., Sharda Motor, Paushak, Agarwal Indl., Best Agrolife, Tips Industries, NMDC, APL Apollo Tubes, ICICI Securities, Sonata Software, Granules India, Poly Medicure, Bhagiradha Chem., Gland Pharma, Vidhi Specialty, Maithan Alloys, L & T Infotech, C D S L, Indraprastha Gas, \"Divis Lab.\", Sterlite Tech., ICICI Lombard, Kama Holdings, Balmer Law. Inv., Lux Industries, Hi-Tech Pipes, Laxmi Organic, Nitin Spinners, Sumitomo Chemi., Guj.St.Petronet, Tanla Platforms, Magellanic Cloud, Jindal Stain., Team Lease Serv., Coforge, Everest Kanto, MMP Industries, Solar Industries, Globus Spirits, Polycab India, IIFL Securities, Godawari Power, Technocraf.Inds., Action Const.Eq., Astec Lifescienc, Astral, Man Infra, Motil.Oswal.Fin., Mold-Tek Pack., KNR Construct., Heranba Inds, Fineotex Chem, Prince Pipes, GNA Axles, MTAR Technologie, Sharda Cropchem, Krishana Phosch., Dixon Technolog., Techno Elec.Engg, SIS, Adani Total Gas, Indus Towers, Avenue Super., Tube Investments, Dr Lal Pathlabs, M B Agro Prod., Indigo Paints, Gujarat Gas, L&T Technology, Gulf Oil Lubric., Apollo Tricoat, Suumaya Indust., Laurus Labs, Metropolis Healt, Fine Organic, Shyam Century, Raghav Product., Bajaj Healthcare, Kwality Pharma, PSP Projects, GTPL Hathway, Happiest Minds, Share India Sec., H.G. Infra Engg., Orient Electric, Route Mobile, Sirca Paints, Rossari Biotech, Affle India, Neogen Chemicals, Chemcon Special., Easy Trip Plann., Nureca]",
      "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
      "user_id": "kislay@gmail.com",
      "insert_time": "10/02/2023, 13:38:51",
      "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
      "id": "3",
      "strat_name_alias": "My Strategy 1"
    },
    "pfst": [
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 1,
        "cagr_mean": "0.20714615254640673",
        "cagr_median": "0.1607973514023211",
        "cagr_std": "0.39163450111371917",
        "sharpe_ratio": "0.8603456149064896",
        "ndatapoint": 259,
        "index_mean": "0.15368826202618358",
        "index_median": "0.1282729418297932",
        "index_std": "0.2655255896603338",
        "index_SR": "0.8806645695094041",
        "alpha_mean": "0.05345789052022315",
        "alpha_median": "0.007659604022283828",
        "alpha_std": "0.20061172412244196",
        "alpha_SR": "0.4898242836994454",
        "cagr_dwn_std": "0.2407708587774011",
        "index_dwn_std": "0.1745139606465597",
        "alpha_dwn_std": "0.10913687275052443",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0.16216216216216217",
        "prob_0": "0.7104247104247104",
        "prob_0_7": "0.6177606177606177",
        "prob_0_15p": "0.5173745173745173",
        "prob_0_25": "0.3745173745173745",
        "prob_0_5": "0.18146718146718147",
        "prob_1": "0.03861003861003861",
        "alpha_0_15": "0.07335907335907337",
        "alpha_0": "0.5135135135135135",
        "alpha_0_7": "0.33976833976833976",
        "alpha_0_15_pos": "0.20463320463320464",
        "alpha_0_25": "0.13127413127413126",
        "alpha_0_5": "0.04247104247104247",
        "alpha_1": "0.003861003861003861",
        "highest_pcagr": "1.9312708096043187",
        "lowest_pcagr": "-0.6035298911552923",
        "highest_index": "0.948643818334735",
        "lowest_index": "-0.5188771843724257",
        "highest_alpha": "1.0552020406422888",
        "lowest_alpha": "-0.28837025695755913",
        "id": 21,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 2,
        "cagr_mean": "0.18567382914592828",
        "cagr_median": "0.18105385492147308",
        "cagr_std": "0.2203656872283419",
        "sharpe_ratio": "1.2404262441560858",
        "ndatapoint": 247,
        "index_mean": "0.13859214726345426",
        "index_median": "0.12391807344371686",
        "index_std": "0.16467738388236408",
        "index_SR": "1.2535410449102393",
        "alpha_mean": "0.04708168188247399",
        "alpha_median": "0.023469194362320422",
        "alpha_std": "0.1178625359503997",
        "alpha_SR": "0.6348583961179589",
        "cagr_dwn_std": "0.14968550530164734",
        "index_dwn_std": "0.11056051800312469",
        "alpha_dwn_std": "0.0741609186715805",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0.048582995951417005",
        "prob_0": "0.757085020242915",
        "prob_0_7": "0.659919028340081",
        "prob_0_15p": "0.5425101214574899",
        "prob_0_25": "0.4008097165991903",
        "prob_0_5": "0.0728744939271255",
        "prob_1": "0",
        "alpha_0_15": "0.012145748987854251",
        "alpha_0": "0.582995951417004",
        "alpha_0_7": "0.3765182186234818",
        "alpha_0_15_pos": "0.19433198380566802",
        "alpha_0_25": "0.06072874493927125",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.8506358545662756",
        "lowest_pcagr": "-0.2572883467763052",
        "highest_index": "0.4977472047628846",
        "lowest_index": "-0.18076051796056136",
        "highest_alpha": "0.3964511542399145",
        "lowest_alpha": "-0.21678029915243013",
        "id": 22,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 3,
        "cagr_mean": "0.18036529009793464",
        "cagr_median": "0.17687090170227604",
        "cagr_std": "0.13018347647383277",
        "sharpe_ratio": "1.962087198517701",
        "ndatapoint": 235,
        "index_mean": "0.1382537853632394",
        "index_median": "0.11388274813155586",
        "index_std": "0.12335855873767877",
        "index_SR": "1.8550715607926251",
        "alpha_mean": "0.04211150473469521",
        "alpha_median": "0.03891723051438456",
        "alpha_std": "0.07746226708326354",
        "alpha_SR": "0.8361211730487356",
        "cagr_dwn_std": "0.09192521628712286",
        "index_dwn_std": "0.0745274674493781",
        "alpha_dwn_std": "0.05036531317720933",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0.00851063829787234",
        "prob_0": "0.9319148936170213",
        "prob_0_7": "0.7787234042553192",
        "prob_0_15p": "0.5659574468085107",
        "prob_0_25": "0.3574468085106383",
        "prob_0_5": "0.00851063829787234",
        "prob_1": "0",
        "alpha_0_15": "0",
        "alpha_0": "0.6468085106382979",
        "alpha_0_7": "0.3191489361702128",
        "alpha_0_15_pos": "0.10212765957446808",
        "alpha_0_25": "0.00851063829787234",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.5226383990202814",
        "lowest_pcagr": "-0.1600374274840235",
        "highest_index": "0.5475733739826809",
        "lowest_index": "-0.15428087349933317",
        "highest_alpha": "0.2634842865567817",
        "lowest_alpha": "-0.0943119662375107",
        "id": 23,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 4,
        "cagr_mean": "0.1836543953051249",
        "cagr_median": "0.18446068664091952",
        "cagr_std": "0.09699523675285633",
        "sharpe_ratio": "2.722751611032364",
        "ndatapoint": 223,
        "index_mean": "0.14017600484996187",
        "index_median": "0.11774279458453396",
        "index_std": "0.09898034119366922",
        "index_SR": "2.5847288216751836",
        "alpha_mean": "0.04347839045516303",
        "alpha_median": "0.03811372227644383",
        "alpha_std": "0.07341533254346708",
        "alpha_SR": "0.8642311704290799",
        "cagr_dwn_std": "0.06745176260697909",
        "index_dwn_std": "0.05423238355778951",
        "alpha_dwn_std": "0.05030875064778855",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0",
        "prob_0": "0.9910313901345291",
        "prob_0_7": "0.8475336322869955",
        "prob_0_15p": "0.5829596412556054",
        "prob_0_25": "0.3004484304932735",
        "prob_0_5": "0",
        "prob_1": "0",
        "alpha_0_15": "0",
        "alpha_0": "0.7085201793721974",
        "alpha_0_7": "0.33183856502242154",
        "alpha_0_15_pos": "0.09865470852017937",
        "alpha_0_25": "0",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.38143924773222304",
        "lowest_pcagr": "-0.016762060928039002",
        "highest_index": "0.4412736231023864",
        "lowest_index": "-0.05003846168218429",
        "highest_alpha": "0.21172771187395267",
        "lowest_alpha": "-0.1334714143245237",
        "id": 24,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 5,
        "cagr_mean": "0.18344594165251993",
        "cagr_median": "0.18596404946986733",
        "cagr_std": "0.08048876165551452",
        "sharpe_ratio": "3.177616261608802",
        "ndatapoint": 211,
        "index_mean": "0.1396569321170822",
        "index_median": "0.1206393486995545",
        "index_std": "0.08952857414522546",
        "index_SR": "2.747434309233519",
        "alpha_mean": "0.043789009535437705",
        "alpha_median": "0.04360899173125432",
        "alpha_std": "0.056576243253841654",
        "alpha_SR": "1.050473923444833",
        "cagr_dwn_std": "0.057730678140362576",
        "index_dwn_std": "0.050831763892489126",
        "alpha_dwn_std": "0.041685003842684476",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0",
        "prob_0": "1",
        "prob_0_7": "0.9146919431279621",
        "prob_0_15p": "0.6208530805687204",
        "prob_0_25": "0.2843601895734597",
        "prob_0_5": "0",
        "prob_1": "0",
        "alpha_0_15": "0",
        "alpha_0": "0.8341232227488151",
        "alpha_0_7": "0.3127962085308057",
        "alpha_0_15_pos": "0.02843601895734597",
        "alpha_0_25": "0",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.33168530532981966",
        "lowest_pcagr": "0.02744132080177253",
        "highest_index": "0.40664253597018907",
        "lowest_index": "-0.00489994761603918",
        "highest_alpha": "0.1643718174499833",
        "lowest_alpha": "-0.1092272870833837",
        "id": 25,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 6,
        "cagr_mean": "0.18007437821010708",
        "cagr_median": "0.1837534201840798",
        "cagr_std": "0.06531361389441812",
        "sharpe_ratio": "3.9105404302439006",
        "ndatapoint": 199,
        "index_mean": "0.13699513007924913",
        "index_median": "0.12269572615621338",
        "index_std": "0.07177489145244409",
        "index_SR": "3.036731398800775",
        "alpha_mean": "0.04307924813085793",
        "alpha_median": "0.04782967968864993",
        "alpha_std": "0.049241405071033036",
        "alpha_SR": "1.147631470416886",
        "cagr_dwn_std": "0.04604846348535919",
        "index_dwn_std": "0.045112692592222475",
        "alpha_dwn_std": "0.037537527718030476",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0",
        "prob_0": "1",
        "prob_0_7": "0.9547738693467337",
        "prob_0_15p": "0.6582914572864321",
        "prob_0_25": "0.1407035175879397",
        "prob_0_5": "0",
        "prob_1": "0",
        "alpha_0_15": "0",
        "alpha_0": "0.8492462311557789",
        "alpha_0_7": "0.3015075376884422",
        "alpha_0_15_pos": "0.010050251256281407",
        "alpha_0_25": "0",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.3497491712433185",
        "lowest_pcagr": "0.027891282788570226",
        "highest_index": "0.3286455013256444",
        "lowest_index": "0.011443429642214564",
        "highest_alpha": "0.15134040325767417",
        "lowest_alpha": "-0.10016735545844657",
        "id": 26,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 7,
        "cagr_mean": "0.17611549789102726",
        "cagr_median": "0.17645500371650114",
        "cagr_std": "0.04888057301845901",
        "sharpe_ratio": "5.211930312505887",
        "ndatapoint": 187,
        "index_mean": "0.13262102289830208",
        "index_median": "0.11331074037870659",
        "index_std": "0.05723575105320693",
        "index_SR": "3.9315416731304627",
        "alpha_mean": "0.0434944749927252",
        "alpha_median": "0.04060382412291497",
        "alpha_std": "0.0386791681820007",
        "alpha_SR": "1.6171696496825583",
        "cagr_dwn_std": "0.03379083896583246",
        "index_dwn_std": "0.033732574629611774",
        "alpha_dwn_std": "0.02689543116349168",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0",
        "prob_0": "1",
        "prob_0_7": "1",
        "prob_0_15p": "0.6844919786096256",
        "prob_0_25": "0.0855614973262032",
        "prob_0_5": "0",
        "prob_1": "0",
        "alpha_0_15": "0",
        "alpha_0": "0.8556149732620321",
        "alpha_0_7": "0.2887700534759358",
        "alpha_0_15_pos": "0",
        "alpha_0_25": "0",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.288055761432243",
        "lowest_pcagr": "0.07179603202569451",
        "highest_index": "0.27662230253605236",
        "lowest_index": "0.04494294530730558",
        "highest_alpha": "0.13081737715263775",
        "lowest_alpha": "-0.0493819187161173",
        "id": 27,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 8,
        "cagr_mean": "0.1744634414278397",
        "cagr_median": "0.16304731183768495",
        "cagr_std": "0.03960322586184247",
        "sharpe_ratio": "6.962101179805545",
        "ndatapoint": 175,
        "index_mean": "0.1292503134300792",
        "index_median": "0.11776934001560546",
        "index_std": "0.04966333146415861",
        "index_SR": "4.301316949262345",
        "alpha_mean": "0.04521312799776052",
        "alpha_median": "0.0459110008340704",
        "alpha_std": "0.03283214255666339",
        "alpha_SR": "2.075409233911613",
        "cagr_dwn_std": "0.025059021252648982",
        "index_dwn_std": "0.030049009397516032",
        "alpha_dwn_std": "0.021785162780906298",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0",
        "prob_0": "1",
        "prob_0_7": "1",
        "prob_0_15p": "0.6857142857142857",
        "prob_0_25": "0.04",
        "prob_0_5": "0",
        "prob_1": "0",
        "alpha_0_15": "0",
        "alpha_0": "0.9428571428571428",
        "alpha_0_7": "0.18857142857142858",
        "alpha_0_15_pos": "0",
        "alpha_0_25": "0",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.2751790590182013",
        "lowest_pcagr": "0.09714885013419239",
        "highest_index": "0.25631549034381296",
        "lowest_index": "0.038217904048539975",
        "highest_alpha": "0.12103154010235118",
        "lowest_alpha": "-0.013305215112120905",
        "id": 28,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 9,
        "cagr_mean": "0.17211282551363166",
        "cagr_median": "0.1698043600202963",
        "cagr_std": "0.039843416237019376",
        "sharpe_ratio": "6.570483150888715",
        "ndatapoint": 163,
        "index_mean": "0.12590419914902226",
        "index_median": "0.1263559997385919",
        "index_std": "0.04527106326646861",
        "index_SR": "4.146480405638438",
        "alpha_mean": "0.04620862636460941",
        "alpha_median": "0.044714940989414975",
        "alpha_std": "0.029462395895252375",
        "alpha_SR": "2.4136177244578465",
        "cagr_dwn_std": "0.026194850753152286",
        "index_dwn_std": "0.03036411289386924",
        "alpha_dwn_std": "0.019144964795528636",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0",
        "prob_0": "1",
        "prob_0_7": "1",
        "prob_0_15p": "0.7116564417177914",
        "prob_0_25": "0.04294478527607362",
        "prob_0_5": "0",
        "prob_1": "0",
        "alpha_0_15": "0",
        "alpha_0": "0.9570552147239264",
        "alpha_0_7": "0.17177914110429449",
        "alpha_0_15_pos": "0",
        "alpha_0_25": "0",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.29514847201679073",
        "lowest_pcagr": "0.0935130685213299",
        "highest_index": "0.2283752299773254",
        "lowest_index": "0.039520684007209095",
        "highest_alpha": "0.12634161644484432",
        "lowest_alpha": "-0.010050502447983556",
        "id": 29,
        "mod_list_pct": null
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "insert_time": "10/02/2023, 13:38:58",
        "strat_name": "{filters: [{Data: {param: {name: Average DE, id: 0}, period: 5, sign: lt, threshold: 200}}, {Data: {param: {name: Average ROCE, id: 1}, period: 5, sign: gte, threshold: 15}, Operator: AND}, {Data: {param: {name: NetSales CAGR, id: 7}, period: 5, sign: gte, threshold: 15}, Operator: AND}]}",
        "nyears": 10,
        "cagr_mean": "0.1718599429266768",
        "cagr_median": "0.17376652155616257",
        "cagr_std": "0.03393514138007396",
        "sharpe_ratio": "6.847961841086682",
        "ndatapoint": 151,
        "index_mean": "0.12560227872054916",
        "index_median": "0.12700847550536842",
        "index_std": "0.039279604488574454",
        "index_SR": "4.519981667064888",
        "alpha_mean": "0.04625766420612765",
        "alpha_median": "0.0460082128907755",
        "alpha_std": "0.02430715171687785",
        "alpha_SR": "2.749260608111756",
        "cagr_dwn_std": "0.025096510014928016",
        "index_dwn_std": "0.027788227469097395",
        "alpha_dwn_std": "0.016825492668699125",
        "avg_no_stock": "121.83333333333333",
        "prob_0_15": "0",
        "prob_0": "1",
        "prob_0_7": "1",
        "prob_0_15p": "0.7682119205298014",
        "prob_0_25": "0",
        "prob_0_5": "0",
        "prob_1": "0",
        "alpha_0_15": "0",
        "alpha_0": "0.9933774834437086",
        "alpha_0_7": "0.15894039735099338",
        "alpha_0_15_pos": "0",
        "alpha_0_25": "0",
        "alpha_0_5": "0",
        "alpha_1": "0",
        "highest_pcagr": "0.24440058510493468",
        "lowest_pcagr": "0.08389170682626745",
        "highest_index": "0.20507136621334143",
        "lowest_index": "0.05386563487776219",
        "highest_alpha": "0.10186968424876763",
        "lowest_alpha": "-0.0035865210384555812",
        "id": 30,
        "mod_list_pct": null
      }
    ],
    "calyears": [
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2000,
        "portfolio_cagr": "-0.29737827464715383",
        "index_cagr": "-0.11389212262320536",
        "id": 43
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2001,
        "portfolio_cagr": "-0.2432148944297302",
        "index_cagr": "-0.20213853003430393",
        "id": 44
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2002,
        "portfolio_cagr": "0.03205561119649292",
        "index_cagr": "-0.0074555184558386944",
        "id": 45
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2003,
        "portfolio_cagr": "0.8065155103436836",
        "index_cagr": "0.8174193548387099",
        "id": 46
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2004,
        "portfolio_cagr": "0.11807219597098983",
        "index_cagr": "0.06686444545869463",
        "id": 47
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2005,
        "portfolio_cagr": "0.486777749192399",
        "index_cagr": "0.43439370987520753",
        "id": 48
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2006,
        "portfolio_cagr": "0.30578198982439275",
        "index_cagr": "0.37118430978124217",
        "id": 49
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2007,
        "portfolio_cagr": "0.44500207556480675",
        "index_cagr": "0.3949729822245043",
        "id": 50
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2008,
        "portfolio_cagr": "-0.577523123287915",
        "index_cagr": "-0.5188771843724257",
        "id": 51
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2009,
        "portfolio_cagr": "1.5675617165537439",
        "index_cagr": "0.9106905408113082",
        "id": 52
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2010,
        "portfolio_cagr": "0.1607973514023211",
        "index_cagr": "0.17405024071690756",
        "id": 53
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2011,
        "portfolio_cagr": "-0.08567908124366697",
        "index_cagr": "-0.041844624447717305",
        "id": 54
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2012,
        "portfolio_cagr": "0.1896257460684867",
        "index_cagr": "0.16212269679328295",
        "id": 55
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2013,
        "portfolio_cagr": "0.02213597580562121",
        "index_cagr": "0.0352401421840125",
        "id": 56
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2014,
        "portfolio_cagr": "0.8051278804200199",
        "index_cagr": "0.3292023667883066",
        "id": 57
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2015,
        "portfolio_cagr": "0.07617889484618012",
        "index_cagr": "-0.09067643878409226",
        "id": 58
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2016,
        "portfolio_cagr": "0.04439786339312368",
        "index_cagr": "0.0815903175085555",
        "id": 59
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2017,
        "portfolio_cagr": "0.3968106128614435",
        "index_cagr": "0.2929870463597819",
        "id": 60
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2018,
        "portfolio_cagr": "-0.22544999220892303",
        "index_cagr": "-0.009738338610525088",
        "id": 61
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2019,
        "portfolio_cagr": "-0.048810012256042756",
        "index_cagr": "0.12713638665006366",
        "id": 62
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2020,
        "portfolio_cagr": "0.3454219213047911",
        "index_cagr": "0.16120351260572208",
        "id": 63
      },
      {
        "session_id": "4657e354-4060-4413-ae5e-cf3530ce0f07",
        "user_id": "kislay@gmail.com",
        "year": 2021,
        "portfolio_cagr": "0.3601939494142268",
        "index_cagr": "0.24938577079231217",
        "id": 64
      }
    ]
  }